tap "aws/tap"
tap "beeftornado/rmtree"
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "loadimpact/k6"
tap "unbounce/taps"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Manage your Java environment
brew "jenv"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Run a Kubernetes cluster locally
brew "minikube"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# UNIX shell (command interpreter)
brew "zsh"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# The fastest shell plugin manager
brew "getantibody/tap/antibody"
# Load testing for the 21st century
brew "loadimpact/k6/k6"
brew "unbounce/taps/iidy"
cask "1password"
cask "adobe-acrobat-reader"
cask "docker"
cask "firefox"
cask "flux"
cask "gimp"
cask "github"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "java11"
cask "java8"
cask "ngrok"
cask "postico"
cask "postman"
cask "sequel-pro"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
cask "zoomus"
