arcticicestudio.nord-visual-studio-code
arrterian.nix-env-selector
bbenoist.Nix
dbaeumer.vscode-eslint
esbenp.prettier-vscode
golang.go
redhat.java
rust-lang.rust
shengchen.vscode-checkstyle
timonwong.shellcheck
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
